NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D34.svd
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2013, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>Atmel</vendor>
  <name>ATSAMA5D34</name>
  <series>SAMA5D3</series>
  <version>20130221</version>
  <description>Atmel ATSAMA5D34 device: ARM Cortex-A5 processor-based embedded MPU, 536MHz, Linux support, FPU, LCD controller, gigabit Ethernet, dual CAN, security (refer to http://www.atmel.com/devices/SAMA5D34.aspx for more)</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>SMD</name>
      <version>11027A</version>
      <description>Software Modem Device</description>
      <baseAddress>0x00400000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SMD</name>
        <value>11</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>AXIMX</name>
      <version>11103A</version>
      <description>AXI Matrix</description>
      <prependToName>AXIMX_</prependToName>
      <baseAddress>0x00800000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REMAP</name>
          <description>Remap Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REMAP0</name>
              <description>Remap State 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REMAP1</name>
              <description>Remap State 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID4</name>
          <description>Peripheral ID Register 4</description>
          <addressOffset>0x00001FD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID5</name>
          <description>Peripheral ID Register 5</description>
          <addressOffset>0x00001FD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID6</name>
          <description>Peripheral ID Register 6</description>
          <addressOffset>0x00001FD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID7</name>
          <description>Peripheral ID Register 7</description>
          <addressOffset>0x00001FDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID0</name>
          <description>Peripheral ID Register 0</description>
          <addressOffset>0x00001FE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID1</name>
          <description>Peripheral ID Register 1</description>
          <addressOffset>0x00001FE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000B3</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID2</name>
          <description>Peripheral ID Register 2</description>
          <addressOffset>0x00001FE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000006B</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPH_ID3</name>
          <description>Peripheral ID Register 3</description>
          <addressOffset>0x00001FEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID0</name>
                  <description>Part Number</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID4</name>
                  <description>4KB count, JEP106 continuation code</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID1</name>
                  <description>JEP106[3:0, part number[11:8]</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID2</name>
                  <description>Revision, JEP106 code flag, JEP106[6:4]</description>
                  <value>0xB6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>COMP_ID[%s]</name>
          <description>Component ID Register</description>
          <addressOffset>0x00001FF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ID</name>
              <description>Component ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMIB3_FN_MOD_BM_ISS</name>
          <description>AMIB3 Bus Matrix Functionality Modification Register</description>
          <addressOffset>0x00005008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_ISS</name>
              <description>Read Issuing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_ISS</name>
              <description>Write Issuing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMIB3_FN_MOD2</name>
          <description>AMIB3 Bypass Merge</description>
          <addressOffset>0x00005024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BP_MRG</name>
              <description>Bypass Merge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASIB0_READ_QOS</name>
          <description>ASIB0 Read Channel QoS Register</description>
          <addressOffset>0x00042100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_QOS</name>
              <description>Read QoS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASIB0_WRITE_QOS</name>
          <description>ASIB0 Write Channel QoS Register</description>
          <addressOffset>0x00042104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WR_QOS</name>
              <description>Write QoS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASIB1_FN_MOD_AHB</name>
          <description>ASIB1 AHB Functionality Modification Register</description>
          <addressOffset>0x00043028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_INCR_OVR</name>
              <description>Read INCR Override</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_INCR_OVR</name>
              <description>Write INCR override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_OVR</name>
              <description>Lock Override</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASIB1_READ_QOS</name>
          <description>ASIB1 Read Channel QoS Register</description>
          <addressOffset>0x00043100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_QOS</name>
              <description>Read QoS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASIB1_WRITE_QOS</name>
          <description>ASIB1 Write Channel QoS Register</description>
          <addressOffset>0x00043104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WR_QOS</name>
              <description>Write QoS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASIB1_FN_MOD</name>
          <description>ASIB1 Issuing Functionality Modification Register</description>
          <addressOffset>0x00043108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_ISS</name>
              <description>Read Issuing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_ISS</name>
              <description>Write Issuing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
