NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D34.svd
        <register>
          <name>HEOCFG1</name>
          <description>High-End Overlay Configuration Register 1</description>
          <addressOffset>0x00000390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Lookup Table Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUVEN</name>
              <description>YUV Color Space Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGBMODE</name>
              <description>RGB input mode selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>12BPP_RGB_444</name>
                  <description>12 bpp RGB 444</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_ARGB_4444</name>
                  <description>16 bpp ARGB 4444</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_RGBA_4444</name>
                  <description>16 bpp RGBA 4444</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_RGB_565</name>
                  <description>16 bpp RGB 565</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_TRGB_1555</name>
                  <description>16 bpp TRGB 1555</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18BPP_RGB_666</name>
                  <description>18 bpp RGB 666</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18BPP_RGB_666PACKED</name>
                  <description>18 bpp RGB 666 PACKED</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19BPP_TRGB_1666</name>
                  <description>19 bpp TRGB 1666</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19BPP_TRGB_PACKED</name>
                  <description>19 bpp TRGB 1666 PACKED</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24BPP_RGB_888</name>
                  <description>24 bpp RGB 888</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24BPP_RGB_888_PACKED</name>
                  <description>24 bpp RGB 888 PACKED</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25BPP_TRGB_1888</name>
                  <description>25 bpp TRGB 1888</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BPP_ARGB_8888</name>
                  <description>32 bpp ARGB 8888</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BPP_RGBA_8888</name>
                  <description>32 bpp RGBA 8888</description>
                  <value>0xD</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLUTMODE</name>
              <description>Color Lookup table input mode selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLUT_1BPP</name>
                  <description>color lookup table mode set to 1 bit per pixel</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_2BPP</name>
                  <description>color lookup table mode set to 2 bits per pixel</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_4BPP</name>
                  <description>color lookup table mode set to 4 bits per pixel</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_8BPP</name>
                  <description>color lookup table mode set to 8 bits per pixel</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YUVMODE</name>
              <description>YUV input mode selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32BPP_AYCBCR</name>
                  <description>32 bpp AYCbCr 444</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_YCBCR_MODE0</name>
                  <description>16 bpp Cr(n)Y(n+1)Cb(n)Y(n) 422</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_YCBCR_MODE1</name>
                  <description>16 bpp Y(n+1)Cr(n)Y(n)Cb(n) 422</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_YCBCR_MODE2</name>
                  <description>16 bpp Cb(n)Y(+1)Cr(n)Y(n) 422</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_YCBCR_MODE3</name>
                  <description>16 bpp Y(n+1)Cb(n)Y(n)Cr(n) 422</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_YCBCR_SEMIPLANAR</name>
                  <description>16 bpp Semiplanar 422 YCbCr</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_YCBCR_PLANAR</name>
                  <description>16 bpp Planar 422 YCbCr</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12BPP_YCBCR_SEMIPLANAR</name>
                  <description>12 bpp Semiplanar 420 YCbCr</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12BPP_YCBCR_PLANAR</name>
                  <description>12 bpp Planar 420 YCbCr</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YUV422ROT</name>
              <description>YUV 4:2:2 Rotation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV422SWP</name>
              <description>YUV 4:2:2 SWAP</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCALEOPT</name>
              <description>Down Scaling Bandwidth Optimization</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG2</name>
          <description>High-End Overlay Configuration Register 2</description>
          <addressOffset>0x00000394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPOS</name>
              <description>Horizontal Window Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPOS</name>
              <description>Vertical Window Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG3</name>
          <description>High-End Overlay Configuration Register 3</description>
          <addressOffset>0x00000398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XSIZE</name>
              <description>Horizontal Window Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YSIZE</name>
              <description>Vertical Window Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG4</name>
          <description>High-End Overlay Configuration Register 4</description>
          <addressOffset>0x0000039C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XMEMSIZE</name>
              <description>Horizontal image Size in Memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YMEMSIZE</name>
              <description>Vertical image Size in Memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG5</name>
          <description>High-End Overlay Configuration Register 5</description>
          <addressOffset>0x000003A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG6</name>
          <description>High-End Overlay Configuration Register 6</description>
          <addressOffset>0x000003A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSTRIDE</name>
              <description>Pixel Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG7</name>
          <description>High-End Overlay Configuration Register 7</description>
          <addressOffset>0x000003A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UVXSTRIDE</name>
              <description>UV Horizontal Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG8</name>
          <description>High-End Overlay Configuration Register 8</description>
          <addressOffset>0x000003AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UVPSTRIDE</name>
              <description>UV Pixel Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG9</name>
          <description>High-End Overlay Configuration Register 9</description>
          <addressOffset>0x000003B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDEF</name>
              <description>Blue Default</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDEF</name>
              <description>Green Default</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDEF</name>
              <description>Red Default</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG10</name>
          <description>High-End Overlay Configuration Register 10</description>
          <addressOffset>0x000003B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKEY</name>
              <description>Blue Color Component Chroma Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GKEY</name>
              <description>Green Color Component Chroma Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RKEY</name>
              <description>Red Color Component Chroma Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG11</name>
          <description>High-End Overlay Configuration Register 11</description>
          <addressOffset>0x000003B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMASK</name>
              <description>Blue Color Component Chroma Key Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMASK</name>
              <description>Green Color Component Chroma Key Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMASK</name>
              <description>Red Color Component Chroma Key Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG12</name>
          <description>High-End Overlay Configuration Register 12</description>
          <addressOffset>0x000003BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRKEY</name>
              <description>Blender Chroma Key Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Blender Inverted Blender Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER2BL</name>
              <description>Blender Iterated Color Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>Blender Use Iterated Color</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REVALPHA</name>
              <description>Blender Reverse Alpha</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAEN</name>
              <description>Blender Global Alpha Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LAEN</name>
              <description>Blender Local Alpha Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Blender Overlay Layer Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Blender DMA Layer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REP</name>
              <description>Use Replication logic to expand RGB color to 24 bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTKEY</name>
              <description>Destination Chroma Keying</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIDPRI</name>
              <description>Video Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GA</name>
              <description>Blender Global Alpha</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG13</name>
          <description>High-End Overlay Configuration Register 13</description>
          <addressOffset>0x000003C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFACTOR</name>
              <description>Horizontal Scaling Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YFACTOR</name>
              <description>Vertical Scaling Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCALEN</name>
              <description>Hardware Scaler Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG14</name>
          <description>High-End Overlay Configuration Register 14</description>
          <addressOffset>0x000003C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSCRY</name>
              <description>Color Space Conversion Y coefficient for Red Component 1:2:7 format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCRU</name>
              <description>Color Space Conversion U coefficient for Red Component 1:2:7 format</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCRV</name>
              <description>Color Space Conversion V coefficient for Red Component 1:2:7 format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCYOFF</name>
              <description>Color Space Conversion Offset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
